Revit 2024 API
BuiltInFailures.StairRampFailures.CannotMakeLanding Property
 Can't make landing.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotMakeLanding { get; }
Visual Basic
Public Shared ReadOnly Property CannotMakeLanding As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotMakeLanding {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace